print('您好！欢迎光临小猫咖啡馆')
print('本店经营的咖啡有:')
a={'1':'蓝山','2':'卡布奇洛','3':'拿铁','4':'皇家咖啡','5':'女王咖啡','6':'美丽与哀愁'}
print('1.蓝山  2.卡布奇洛  3.拿铁  4.皇家咖啡  5.女王咖啡  6.美丽与哀愁')
try:
    b = input('请输入您喜欢的咖啡编号')
    print('您的咖啡{0}好了，请您慢用...'.format(a[b]))
except:
    print('对不起，没有您输入的编号')

print('------------------------------------------------------------')
coffee=('蓝山','卡布奇诺','拿铁','皇家咖啡','女王咖啡','美丽与哀愁')
print('您好！欢迎光临小猫咖啡馆')
print('本店经营的咖啡有:')
for index,item in enumerate(coffee):
    print(index+1,'.',item,end='  ')

index=int(input('\n请输入您喜欢的咖啡编号'))
if 0<index<=len(coffee):
    print(f'您的咖啡{coffee[index-1]}好了，请您慢用...')