# Python的四种群数据类型：列表，字典，元组和集合
# 新知识点：字典应用
# d1 = {}      #  新建空字典
# d1['0908998786'] = '思想与品德（第二版）'
# d1['7567656656'] = ['C语言程序设计',36.5]    # 添加了一个键值对
# d1['8886549088'] = ['模拟电子技术',66]    # 添加了一个键值对
# print(d1)
# a,b = d1['8886549088']    #分别对a,b变量赋值
#
# print(a,b)

# # 新知识点：计数与排序的最佳方法---字典计数，再排序
d2 = {}      #  新建空字典
d2['7567656656'] = d2.get('7567656656', 0) + 1
d2['0098787811'] = d2.get('0098787811', 0) + 1
d2['7567656656'] = d2.get('7567656656', 0) + 1
d2['8888888888'] = d2.get('8888888888', 0) + 1
d2['8888888888'] = d2.get('8888888888', 0) + 1
d2['8888888888'] = d2.get('8888888888', 0) + 1
print(d2)
lt = list(d2.items())
print(lt)
lt.sort(key=lambda z: z[1], reverse=True)
print(lt)

# 新知识点：判断字典元素是否存在
# https://www.pythontab.com/html/2012/pythonjichu_1227/67.html