# -*- coding:utf-8 -*-
print("""
                                    敲    敲
                                   敲    敲
                                  敲    敲
                                  
                                 敲     敲
                                敲     敲
                               敲     敲
                                
                         敲   敲     敲
                        敲   敲     敲
                       敲   敲     敲
                
                     敲   敲     敲      敲       敲
                    敲   敲     敲      敲       敲
                   敲   敲     敲      敲       敲
                 敲                        敲      敲
                敲                        敲        敲
                 敲                      敲        敲
                 
                  敲                             敲
                   敲                           敲
                    敲                         敲
                    
                     敲
                      敲
                       敲
                        
                        敲
                         敲
                          敲
                         
""")